import javax.swing.JOptionPane;

public class carClass {
	public void tank(){
		JOptionPane.showMessageDialog(null, "戰車：位在革命時期。屬木的特質天生向陽獨立，不過太過時會變孤立。\n"
				+ "腳踏實地的實踐者，戰車不怕做事，對看不慣的事寧可自己動手做，口頭禪「讓開，我自己來做」，常把自己搞到很累。\n"
				+ "自我管理能力很強，不喜歡被人管理，通常是公司裡的管理職。有天生的第6感，有創意。更有一顆不甘心。\n"
				+ "命帶雙戰車的人，老天是派妳下來做事情的。\n"
				+ "建議：透過讚美、鼓勵團隊，戰車不只能喘口氣，人際關係也會更好。");
	}
	public void train(){
		JOptionPane.showMessageDialog(null, "火車：位在太平前期。變動整理格，追隨型。火車只能走在鐵軌上，更不能隨意變換軌道，所以火車個性的人會以既定的思維模式（軌道）思考做事，很難改變他。\n"
				+ "當火車行使路線上遇到阻礙時，火車會鳴笛或停下來等障礙物移開，所以火車常常「山轉路不轉，路轉人不轉」的思維模式會讓旁人很難與其溝通。\n"
				+ "火車重視規律，非常不能忍受別人改來改去。具有守成的能力。能整理組織的變動，軍師的才能。\n"
				+ "火車天生顧家但是回家卻不說話。\n"
				+ "建議：對火車來說最重要的就是3件事：1.跟對人。2.跟對環境。3.學會笑。如果妳身邊有火車的朋友需要妳幫他換軌道，第一件事是先融入他，讓自己先作一條接駁軌。");
	}
	public void sportCar(){
		JOptionPane.showMessageDialog(null, "跑車：位在淫亂前期（組織分化期）。跑車奔馳在跑道最重要的就是終點（目標），所以人生目標對跑車個性的人十分重要，如果沒有目標感，取而代之的是強烈的空虛感。\n"
				+ "跑車很容易被人影響，哪裡好像不錯就往哪裡去，所以跑車易變、對目標的穩定度不夠堅持。跑車天生具有在團隊中帶動氣氛的能力。\n"
				+ "建議：找到明確的目標、學習的榜樣，然後就是穩定堅持的價值觀。成功是屬於價值觀穩定比別人久的人。");
}
	public void babyCar(){
		JOptionPane.showMessageDialog(null, "娃娃車：位在太平後期，屬水的特質型態隨環境而變，可方可圓，所以耳根子軟，容易被影響。\n"
				+ "天生具有親和力，善與人合作。好學習新東西，但往往學不精，「樣樣通，樣樣鬆」。具有短暫性的爆發力，人稱「3分鐘熱度」。\n"
				+ "有學習的娃娃車具有精準的分析力，但不學習的娃娃車就只有幻想力了。\n"
				+ "建議：好好運用與人合作的能力，借力使力不費力。對娃娃車逼他不如鼓勵他。");
	}
	public void limousine(){
		JOptionPane.showMessageDialog(null, "禮車：位在淫亂後期。禮車的功用就是接送貴賓，所以禮車具有絕佳的人緣，魅力值居冠，但禮車天生敏感，所以常常會想太多，導致禮車非常矛盾，禮車有人緣卻會害怕人群。\n"
				+ "建議：單純點，別想太多");
	}
}
